//Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе//
/*
int Sum(int n)
{

int sum = 0;

while (n > 0)
{
    int current = n % 10;
    n = n / 10;
   sum = sum + current;
}

return sum;

}


Console.WriteLine("Input n:  ");
int n = Convert.ToInt32(Console.ReadLine());

Console.WriteLine(Sum(n));
*/