//Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N//
/*
void Cube(int n)
{
  
int current = 1;

while (n >= current) 
{ int cube = current*current*current;
  Console.Write(cube + "   ");
  current++;    
}

}



Console.WriteLine("Input num");
int n = Convert.ToInt32(Console.ReadLine());

Cube(n);
*/